Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["go-libp2p/.github/workflows/semantic-pull-request.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/workflows/semantic-pull-request.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: "Semantic PR"
            
            on:
              pull_request_target:
                types:
                  - opened
                  - edited
                  - synchronize
            
            jobs:
              main:
                name: Validate PR title
                runs-on: ubuntu-latest
                steps:
                  - uses: amannn/action-semantic-pull-request@01d5fd8a8ebb9aafe902c40c53f0f4744f7381eb # v5.0.2
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
                    with:
                      # Configure which types are allowed (newline delimited).
                      types: |
                        feat
                        fix
                        chore
                        docs
                        deps
                        test
                        refactor
                        ci
                      requireScope: false
        EOT
      + file                = ".github/workflows/semantic-pull-request.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "go-libp2p"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rust-libp2p/.github/workflows/semantic-pull-request.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/workflows/semantic-pull-request.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: "Semantic PR"
            
            on:
              pull_request_target:
                types:
                  - opened
                  - edited
                  - synchronize
            
            jobs:
              main:
                name: Validate PR title
                runs-on: ubuntu-latest
                steps:
                  - uses: amannn/action-semantic-pull-request@01d5fd8a8ebb9aafe902c40c53f0f4744f7381eb # v5.0.2
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
                    with:
                      # Configure which types are allowed (newline delimited).
                      types: |
                        feat
                        fix
                        chore
                        docs
                        deps
                        test
                        refactor
                        ci
                      requireScope: false
        EOT
      + file                = ".github/workflows/semantic-pull-request.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "rust-libp2p"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->